Term4/matlog/lectures/10.tex
% Created 2022-06-11 Sat 01:27
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{fancyhdr}
\usepackage{lastpage}
\usepackage{titling}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{svg}
\usepackage{capt-of}
\usepackage{cmll}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\input{~/.emacs.d/preamble.sty}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 10}
\hypersetup{
	pdfauthor={Ilya Yaroshevskiy},
	pdftitle={Лекция 10},
	pdfkeywords={},
	pdfsubject={},
	pdfcreator={Emacs 28.1 (Org mode 9.5.3)},
	pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Рекурсивные функции}
\label{sec:org698b523}
\begin{definition}
	\(f: \N^n \to \N\)
	\begin{enumerate}
		\item \(Z: \N \to \N\) \\
		      \(Z(x) = 0\)
		\item \(N: \N \to \N\) \\
		      \(N(x) = x + 1\)
		\item \(S_k: \N^m \to \N\)
		      \begin{itemize}
			      \item \(f_1, \dots, f_k:\ \N^m \to \N\)
			      \item \(g: \N^k \to \N\)
		      \end{itemize}
		      \[S_k \pair{g, f_1, \dots, f_k}(x_1,\dots,x_m) = g(f_1(\overline{x}), f_2(\overline{x}),\dots,f_k(\overline{x}))\] \\
		      , где \(\overline{x} = x_1,\dots,x_m\)
		\item \(P^l_k: \N^k \to \N\), \(l \le k\)
		      \[ P^l_k(x_1, \dots, x_k) = x_l \]
		\item \(R\pair{f, g}: \N^{m + 1} \to \N\) --- \textbf{примитивная рекурсия}
		      \begin{itemize}
			      \item \(f: \N^m \to \N\)
			      \item \(g: \N^{m + 2} \to \N\)
			            \[ R\pair{f, g}(y, x_1, \dots, x_m) = \begin{cases}
					            f(x_1, \dots, x_m)                                              & y = 0 \\
					            g(y - 1, R\pair{f, g}(y - 1, x_1, \dots, x_m), x_1, \dots, x_m) & y > 0
				            \end{cases} \]
		      \end{itemize}
	\end{enumerate}
	\label{orgc91aba0}
\end{definition}
\begin{examp}
	\[ R\pair{f, g}(0, x) = f(x) \]
	\[ R\pair{f, g}(1, x) = g(0, f(x), x) \]
	\[ R\pair{f, g}(2, x) = g(1, g(0, f(x), x), x) \]
\end{examp}
\begin{definition}
	\(f: \N^m \to \N\) --- \textbf{примитивно-рекурсивная}, если найдется \(g\) -- выражение \(f\) через примитивы \(Z, N, S, P, R\), т.е. \(f(x_1, \dots, x_n) = g(x_1, \dots, x_n)\)
	\label{org35d6b3d}
\end{definition}
\begin{examp}
	\-
	\begin{itemize}
		\item \(1 = S\pair{N, Z}\)
		\item \((+2) = S\pair{N, N}\)
		      \[ S\pair{\underset{g}{N}, \underset{f}{N}}(x) = g(f(x)) = N(N(x)) = x + 2 \]
		\item \((+3) = S\pair{N, (+2)}\)
		\item \((\times 2)_a = R\pair{P^1_1, S\pair{N, P^2_3}}\)
		      \[ f(a, b) = \begin{cases}
				      b               & a = 0 \\
				      f(a - 1, b + 1) & a > 0
			      \end{cases} \]
		      --- это почти определение \(+\), т.е. \(f(x, x) = x\cdot 2\)
		      \[ (\times 2)_a = \begin{cases}
				      P^1_1(a) & y = 0 \\
				      b + 1    & y > 0
			      \end{cases} \fixme \]
		      , где \(a\) --- счетчик, \(b\) --- предыдущее значение, \(c\) --- \(x\)
		\item \((\times 2) = S \pair{(\times 2)_a, P^1_1, P^1_1}\)
	\end{itemize}
\end{examp}
\begin{definition}
	\-
	\begin{enumerate}
		\setcounter{enumi}{5}
		\item \(M\pair{f}: \N^m \to \N\) --- \textbf{минимизация}
		      \begin{itemize}
			      \item \(f: \N^{m + 1} \to \N\)
		      \end{itemize}
		      \[ M\pair{f}(x_1, \dots, x_m) = y \]
		      --- минимальный \(y\)
		      \[ f(y, x_1, \dots, x_m) = 0 \]
		      Если \(f(y, x_1, \dots, x_m) > 0\) при всех \(y\), то результат не определен
	\end{enumerate}
	\label{org2ddd353}
\end{definition}

\begin{theorem}
	\((+), (\cdot), (x^y), (:), (\sqrt)\), деление с остатком --- примитивно-рекурсивные функции
	\label{org54c4050}
\end{theorem}
\begin{lemma}
	\(p_1, p_2, \dots\) --- простые числа. \\
	\(p(i): \N \to \N\), \(p(i) - p_i\) --- примитивно-рекурсивная функция
	\label{org34026cc}
\end{lemma}
\begin{definition}
	\(\mathop{\rm plog}_nk = \max t: n^t | k\) --- примитивно-рекурсивная функция
	\label{org7fbcdc5}
\end{definition}
\begin{examp}
	\-
	\begin{itemize}
		\item \(\mathop{\rm plog}_5 120 = 1\)
		\item \(\mathop{\rm plog}_2 120 = 3\)
	\end{itemize}
\end{examp}
\subsection{Функция Аккермана}
\label{sec:orgc7abfc8}
\[ A(m, n) = \begin{cases}
		n + 1                 & m = 0         \\
		A(m - 1, 1)           & m > 0,\ n = 0 \\
		A(m - 1, A(m, n - 1)) & m > 0, n > 0
	\end{cases} \]
\begin{lemma}
	\(A(m, n)\) --- не примитивно-рекурсивная
\end{lemma}
Можно сказать что если есть текст длинны \(n\), которые выводит текст длинны \(k\), то текст длинны \(n + 1\) не может выводить текст больше чем \(k^k\) \fixme
\section{Связь с формальной арифметикой}
\label{sec:orgf8bf09e}
\begin{theorem}
	\(f\) --- рекурсивная функция, тогда \(f\) представима в формальной арифметике
	\label{org5a67b3d}
\end{theorem}
\begin{theorem}
	Если \(f\) представима в формальной арифметике, то она рекурсивна
	\label{orgb31638b}
\end{theorem}
\begin{remark}
	\-
	\begin{itemize}
		\item \(\vdash \varphi\) --- доказательство (\(\varphi\)) в ФА
		\item \(\delta_1, \dots, \delta_n \equiv \varphi\) --- доказательство
		\item \(C\) --- функция(рекурсивная), превращающая доказательство в ФА \\
		      \[ C(p, x) \begin{matrix}
				      = 0    & \text{если доказательство корректно} \\
				      \neq 0 & \text{если не доказуемо}
			      \end{matrix} \], где \(p\) --- запись доказательства, \(x\) --- формула
		\item Формула \(\delta(p, x, y)\) -- доказательство
	\end{itemize}
\end{remark}
\todo
\begin{remark}
	Проблема останова
	\[P(p, x) = \begin{cases}
			0, \text{если }p(x)\text{ останавливается} \\
			1, \text{если не останавливается}
		\end{cases} \]
	\[ Q(p, x) = \text{\color{red}if } P(p, p) = 1 \text{ \color{red}then } 0 \text{ \color{red}else while \color{blue}true \color{red}do;}\]
\end{remark}
\begin{theorem}
	Примитивы \(Z, N, S, P\) представимы в ФА
	\label{orge1881c3}
\end{theorem}
\begin{proof}
	Аргументы: \(x_1, \dots, x_n\)
	\begin{enumerate}
		\item \(Z(x): \N \to \N\)
		      \[ \xi \coloneqq x_1 = x_1 \& x_2 = 0 \]
		\item \(N(x): \N \to \N\)
		      \[ \nu \coloneqq x_2 = x_1' \]
		\item \(P_k^l(x, \dots, x_k): \N^k \to \N\)
		      \[ \pi_k^l \coloneqq x_1 = x_1 \& x_2 = x_2 \& \dots \& x_l = x_{k + 1} \& \dots \& x_k = x_k\]
		      \[ \left(\bigwith_{i \neq l} x_i = x_i\right) \& x_l = x_{k + 1} \]
		\item \(S\pair{\underset{\gamma}{g}, \underset{\varphi_1}{f_1}, \dots, \underset{\varphi_k}{f_k}}\)
		      \begin{itemize}
			      \item \((x_1, \dots, x_m) = x_{m + 1}\)
		      \end{itemize}
		      \[ \exists r_1. \exists r_2. \dots\exists r_k. \varphi_1(x_1, \dots, x_m, r_1) \& \dots \& \varphi_k(x_1, \dots, x_m, r_k) \& \gamma(r_1, \dots, r_k, x_{m + 1}) \]
	\end{enumerate}
	\label{org6deb492}
\end{proof}
\begin{definition}
	\(\beta\)-функция Геделя
	\[ \beta(b, c, i) = b \mathop{\rm mod} (1 + c\cdot(i + 1)) \]
	\label{org4e4d68b}
\end{definition}
\begin{theorem}
	\-
	\begin{itemize}
		\item \(a_0, a_1, \dots, a_k\) --- некоторые значения \(\in \N\)
	\end{itemize}
	\uline{Тогда} найдутся \(b\) и \(c\), что
	\[ \beta(b, c, i) = a_i \]
	\label{orgaf83556}
\end{theorem}
\begin{proof}
	\todo
\end{proof}
\begin{remark}
	\(\beta\)-функция Геделя --- представима в ФА
	\[ B(b, c, i, q) = (\exists p. b = p\cdot(q + c\cdot(1 + i)) + q) \& q < b \]
	\label{org7ff4c81}
\end{remark}
\begin{remark}
	\-
	\begin{itemize}
		\item \(M\pair{f}\),  \(f: \N^{m + 1} \to \N\)
		      \[ \varphi(x_{m + 1}, x_1, \dots, x_m, \overline{0}) \& \forall y. y < x_{m + 1} \to \neg \varphi(y, x_1, \dots, x_m, \overline{0}) \]
		      , где \((a < b) = (\exists n. a+ n = b)\&\neg a = b\)
		\item \[R\pair{g, x_1, \dots, x_n}  = \begin{cases}
				      f(x_1, \dots, x_n) y = 0                             & y = 0 \\
				      g(y - 1, R(y - 1, x_1, \dots, x_n), x_1, \dots, x_n) & y > 0
			      \end{cases}\]
		      \[ \exists b. \exists c. \exists f. \varphi(x_1, \dots, x_n f) \& B(b, c, \overline{0}, f) \& \\ \]
		      \[ \& \forall y. y < x_{n + 1} \to \exists r_{y}. B(b, c, y, r_{y})\&\exists r_{y + 1}. B(b, c, y + 1, r_{y + 1})\&\gamma(y, r_{y}, x_1, \dots, x_n, r_{y + 1}) \]
	\end{itemize}
	\label{orge0e7aea}
\end{remark}
\end{document}
